Revit 2024 API
BuiltInFailures.ConstraintFailures.UndeletedConstraints Property
 A dimension that has lock constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UndeletedConstraints { get; }
Visual Basic
Public Shared ReadOnly Property UndeletedConstraints As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UndeletedConstraints {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConstraintFailures Class
Autodesk.Revit.DB Namespace